spring-ws-security/src/test/resources/org/springframework/ws/soap/security/wss4j/emptySecurityHeader-soap.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header>
        <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
                       SOAP-ENV:mustUnderstand="1">
        </wsse:Security>
    </SOAP-ENV:Header>
    <SOAP-ENV:Body>
        <tru:StockSymbol xmlns:tru="http://fabrikam123.com/payloads">QQQ</tru:StockSymbol>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
